"""Задача 2: 
Найдите сумму цифр трехзначного числа.
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)"""

# a = int(input("Введите число: "))
# b = a // 100
# c = a // 10 % 10
# print(b+c+d)

a = int(input("Введите трехзначное число: "))
print((a // 100) + (a // 10 % 10) + (a % 10))
